Revit 2026 API

# PartMakerMethodForMergePartFailures Properties

---

The BuiltInFailuresPartMakerMethodForMergePartFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MergedPartHasDisConnectedGeometries | A merged part geometry has dis-connected components. |
|  | NeedTwoPartsToMerge | Attempt to merge fewer than two parts. There must be at least two. No part will be produced. |
|  | PartNotIncludedInMerge | This part is not geometrically coincident with another part of the same material. No merge possible. |
|  | PartsCannotBeMerged | This PartMaker refers to parts which cannot be merged. |
|  | UnableToIncludePartInMerge | Attempt to merge this Part results in failure of boolean operation. Cannot compute combined geometry. |

#### Reference

BuiltInFailuresPartMakerMethodForMergePartFailures Class

Autodesk.Revit.DB Namespace